betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm_ex.c
/**
  *
  * @file    apm32f4xx_dal_rcm_ex.c
  * @brief   Extension RCM DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities RCM extension peripheral:
  *           + Extended Peripheral Control functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup RCMEx RCMEx
  * @brief RCMEx DAL module driver
  * @{
  */

#ifdef DAL_RCM_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup RCMEx_Private_Constants
  * @{
  */
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup RCMEx_Exported_Functions RCMEx Exported Functions
  *  @{
  */

/** @defgroup RCMEx_Exported_Functions_Group1 Extended Peripheral Control functions
 *  @brief  Extended Peripheral Control functions
 *
@verbatim
 ===============================================================================
                ##### Extended Peripheral Control functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the RCM Clocks
    frequencies.
    [..]
    (@) Important note: Care must be taken when DAL_RCMEx_PeriphCLKConfig() is used to
        select the RTC clock source; in this case the Backup domain will be reset in
        order to modify the RTC Clock source, as consequence RTC registers (including
        the backup registers) and RCM_BDCTRL register are set to their reset values.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the RCM extended peripherals clocks according to the specified parameters in the
  *         RCM_PeriphCLKInitTypeDef.
  * @param  PeriphClkInit pointer to an RCM_PeriphCLKInitTypeDef structure that
  *         contains the configuration information for the Extended Peripherals clocks(I2S and RTC clocks).
  *
  * @note   A caution to be taken when DAL_RCMEx_PeriphCLKConfig() is used to select RTC clock selection, in this case
  *         the Reset of Backup domain will be applied in order to modify the RTC Clock source as consequence all backup
  *        domain (RTC and RCM_BDCTRL register expect BKPSRAM) will be reset
  *
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RCMEx_PeriphCLKConfig(RCM_PeriphCLKInitTypeDef  *PeriphClkInit)
{
  uint32_t tickstart = 0U;
  uint32_t tmpreg1 = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_PERIPHCLOCK(PeriphClkInit->PeriphClockSelection));

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /*---------------------------- SDRAM configuration ---------------------------*/
  if(((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_SDRAM) == RCM_PERIPHCLK_SDRAM)
  {
    /* Check for parameters */
    ASSERT_PARAM(IS_RCM_SDRAM_DIV(PeriphClkInit->SDRAMClockDivision));

    /* Set RCM CFG parameters */
    MODIFY_REG(RCM->CFG, RCM_CFG_SDRAMPSC, \
              (PeriphClkInit->SDRAMClockDivision << RCM_CFG_SDRAMPSC_Pos));
  }
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
  /*---------------------------- I2S configuration ---------------------------*/
  if((((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_I2S) == RCM_PERIPHCLK_I2S) ||
     (((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_PLLI2S) == RCM_PERIPHCLK_PLLI2S))
  {
    /* check for Parameters */
    ASSERT_PARAM(IS_RCM_PLL2C_VALUE(PeriphClkInit->PLLI2S.PLL2C));
    ASSERT_PARAM(IS_RCM_PLL2A_VALUE(PeriphClkInit->PLLI2S.PLL2A));
#if defined(APM32F411xx)
    ASSERT_PARAM(IS_RCM_PLL2B_VALUE(PeriphClkInit->PLLI2S.PLL2B));
#endif /* APM32F411xx */
    /* Disable the PLLI2S */
    __DAL_RCM_PLLI2S_DISABLE();
    /* Get tick */
    tickstart = DAL_GetTick();
    /* Wait till PLLI2S is disabled */
    while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLL2RDY)  != RESET)
    {
      if((DAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
      {
        /* return in case of Timeout detected */
        return DAL_TIMEOUT;
      }
    }

#if defined(APM32F411xx)
    /* Configure the PLLI2S division factors */
    /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) * (PLL2A/PLL2B) */
    /* I2SCLK = f(PLLI2S clock output) = f(VCO clock) / PLL2C */
    __DAL_RCM_PLLI2S_I2SCLK_CONFIG(PeriphClkInit->PLLI2S.PLL2B, PeriphClkInit->PLLI2S.PLL2A, PeriphClkInit->PLLI2S.PLL2C);
#else
    /* Configure the PLLI2S division factors */
    /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) * (PLL2A/PLLB) */
    /* I2SCLK = f(PLLI2S clock output) = f(VCO clock) / PLL2C */
    __DAL_RCM_PLLI2S_CONFIG(PeriphClkInit->PLLI2S.PLL2A , PeriphClkInit->PLLI2S.PLL2C);
#endif /* APM32F411xx */

    /* Enable the PLLI2S */
    __DAL_RCM_PLLI2S_ENABLE();
    /* Get tick */
    tickstart = DAL_GetTick();
    /* Wait till PLLI2S is ready */
    while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLL2RDY)  == RESET)
    {
      if((DAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
      {
        /* return in case of Timeout detected */
        return DAL_TIMEOUT;
      }
    }
  }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

  /*---------------------------- RTC configuration ---------------------------*/
  if(((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_RTC) == (RCM_PERIPHCLK_RTC))
  {
    /* Check for RTC Parameters used to output RTCCLK */
    ASSERT_PARAM(IS_RCM_RTCCLKSOURCE(PeriphClkInit->RTCClockSelection));

    /* Enable Power Clock*/
    __DAL_RCM_PMU_CLK_ENABLE();

