betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm_ex.c
    /* Enable write access to Backup domain */
    PMU->CTRL |= PMU_CTRL_BPWEN;

    /* Get tick */
    tickstart = DAL_GetTick();

    while((PMU->CTRL & PMU_CTRL_BPWEN) == RESET)
    {
      if((DAL_GetTick() - tickstart ) > RCM_DBP_TIMEOUT_VALUE)
      {
        return DAL_TIMEOUT;
      }
    }
    /* Reset the Backup domain only if the RTC Clock source selection is modified from reset value */
    tmpreg1 = (RCM->BDCTRL & RCM_BDCTRL_RTCSRCSEL);
    if((tmpreg1 != 0x00000000U) && ((tmpreg1) != (PeriphClkInit->RTCClockSelection & RCM_BDCTRL_RTCSRCSEL)))
    {
      /* Store the content of BDCTRL register before the reset of Backup Domain */
      tmpreg1 = (RCM->BDCTRL & ~(RCM_BDCTRL_RTCSRCSEL));
      /* RTC Clock selection can be changed only if the Backup Domain is reset */
      __DAL_RCM_BACKUPRESET_FORCE();
      __DAL_RCM_BACKUPRESET_RELEASE();
      /* Restore the Content of BDCTRL register */
      RCM->BDCTRL = tmpreg1;

      /* Wait for LSE reactivation if LSE was enable prior to Backup Domain reset */
      if(DAL_IS_BIT_SET(RCM->BDCTRL, RCM_BDCTRL_LSEEN))
      {
        /* Get tick */
        tickstart = DAL_GetTick();

        /* Wait till LSE is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_LSERDY) == RESET)
        {
          if((DAL_GetTick() - tickstart ) > RCM_LSE_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
    }
    __DAL_RCM_RTC_CONFIG(PeriphClkInit->RTCClockSelection);
  }

#if defined(APM32F403xx) || defined(APM32F402xx)
  /*------------------------------ ADC clock Configuration ------------------*/
  if (((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_ADC) == RCM_PERIPHCLK_ADC)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_ADCPLLCLK_DIV(PeriphClkInit->AdcClockSelection));

    /* Configure the ADC clock source */
    __DAL_RCM_ADC_CONFIG(PeriphClkInit->AdcClockSelection);
  }

  /*------------------------------ USB clock Configuration ------------------*/
  if (((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_USB) == RCM_PERIPHCLK_USB)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_USBPLLCLK_DIV(PeriphClkInit->UsbClockSelection));

    /* Configure the USB clock source */
    __DAL_RCM_USB_CONFIG(PeriphClkInit->UsbClockSelection);
  }
#endif /* APM32F403xx || APM32F402xx */

#if defined(APM32F411xx)
  /*---------------------------- TMR configuration ---------------------------*/
  if(((PeriphClkInit->PeriphClockSelection) & RCM_PERIPHCLK_TMR) == (RCM_PERIPHCLK_TMR))
  {
    __DAL_RCM_TMRCLKPRESCALER(PeriphClkInit->TMRPresSelection);
  }
#endif /* APM32F411xx */
  return DAL_OK;
}

/**
  * @brief  Configures the RCM_OscInitStruct according to the internal
  * RCM configuration registers.
  * @param  PeriphClkInit pointer to an RCM_PeriphCLKInitTypeDef structure that
  * will be configured.
  * @retval None
  */
void DAL_RCMEx_GetPeriphCLKConfig(RCM_PeriphCLKInitTypeDef  *PeriphClkInit)
{
  uint32_t tempreg;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
  /* Set all possible values for the extended clock type parameter------------*/
  PeriphClkInit->PeriphClockSelection = RCM_PERIPHCLK_I2S | RCM_PERIPHCLK_RTC;
#else
  /* Set all possible values for the extended clock type parameter------------*/
  PeriphClkInit->PeriphClockSelection = RCM_PERIPHCLK_RTC;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
  /* Get the PLLI2S Clock configuration --------------------------------------*/
  PeriphClkInit->PLLI2S.PLL2A = (uint32_t)((RCM->PLL2CFG & RCM_PLL2CFG_PLL2A) >> RCM_PLL2CFG_PLL2A_Pos);
  PeriphClkInit->PLLI2S.PLL2C = (uint32_t)((RCM->PLL2CFG & RCM_PLL2CFG_PLL2C) >> RCM_PLL2CFG_PLL2C_Pos);
#if defined(APM32F411xx)
  PeriphClkInit->PLLI2S.PLL2B = (uint32_t)(RCM->PLL2CFG & RCM_PLL2CFG_PLL2B);
#endif /* APM32F411xx */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

  /* Get the RTC Clock configuration -----------------------------------------*/
  tempreg = (RCM->CFG & RCM_CFG_RTCPSC);
  PeriphClkInit->RTCClockSelection = (uint32_t)((tempreg) | (RCM->BDCTRL & RCM_BDCTRL_RTCSRCSEL));

#if defined(APM32F411xx)
  /* Get the TMR Prescaler configuration -------------------------------------*/
  if ((RCM->CFGSEL & RCM_CFGSEL_CLKPSEL) == RESET)
  {
    PeriphClkInit->TMRPresSelection = RCM_TMRPRES_DESACTIVATED;
  }
  else
  {
    PeriphClkInit->TMRPresSelection = RCM_TMRPRES_ACTIVATED;
  }
#endif /* APM32F411xx */
#else
  /* Set all possible values for the extended clock type parameter------------*/
  PeriphClkInit->PeriphClockSelection = RCM_PERIPHCLK_RTC;

  /* Get the RTC configuration -----------------------------------------------*/
  tempreg = __DAL_RCM_GET_RTC_SOURCE();
  /* Source clock is LSE or LSI*/
  PeriphClkInit->RTCClockSelection = tempreg;

  /* Get the I2S2 clock configuration -----------------------------------------*/
  PeriphClkInit->PeriphClockSelection |= RCM_PERIPHCLK_I2S2;
  PeriphClkInit->I2s2ClockSelection = RCM_I2S2CLKSOURCE_SYSCLK;

  /* Get the ADC clock configuration -----------------------------------------*/
  PeriphClkInit->PeriphClockSelection |= RCM_PERIPHCLK_ADC;
  PeriphClkInit->AdcClockSelection = __DAL_RCM_GET_ADC_SOURCE();

  /* Get the USB clock configuration -----------------------------------------*/
  PeriphClkInit->PeriphClockSelection |= RCM_PERIPHCLK_USB;
  PeriphClkInit->UsbClockSelection = __DAL_RCM_GET_USB_SOURCE();
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

