betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm_ex.c
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F402xx) || defined(APM32F403xx)
/**
  * @brief  Return the peripheral clock frequency for a given peripheral(SAI..)
  * @note   Return 0 if peripheral clock identifier not managed by this API
  * @param  PeriphClk Peripheral clock identifier
  *         This parameter can be one of the following values:
  *            @arg RCM_PERIPHCLK_I2S : I2S peripheral clock
  *            @arg RCM_PERIPHCLK_I2S2: I2S2 peripheral clock (*)
  *            @arg RCM_PERIPHCLK_RTC : RTC peripheral clock (*)
  *            @arg RCM_PERIPHCLK_ADC : ADC peripheral clock (*)
  *            @arg RCM_PERIPHCLK_USB : USB peripheral clock (*)
  * @retval Frequency in KHz
  */
uint32_t DAL_RCMEx_GetPeriphCLKFreq(uint32_t PeriphClk)
{
  /* This variable used to store the I2S clock frequency (value in Hz) */
  uint32_t frequency = 0U;
#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t temp_reg = 0U;
  uint32_t prediv = 0U;
  uint32_t pllclk = 0U;
  uint32_t pllmul = 0U;
#else
  /* This variable used to store the VCO Input (value in Hz) */
  uint32_t vcoinput = 0U;
  uint32_t srcclk = 0U;
  /* This variable used to store the VCO Output (value in Hz) */
  uint32_t vcooutput = 0U;
#endif /* APM32F403xx || APM32F402xx */
  switch (PeriphClk)
  {
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
    case RCM_PERIPHCLK_I2S:
    {
      /* Get the current I2S source */
      srcclk = __DAL_RCM_GET_I2S_SOURCE();
      switch (srcclk)
      {
      /* Check if I2S clock selection is External clock mapped on the I2S_CKIN pin used as I2S clock */
      case RCM_I2SCLKSOURCE_EXT:
        {
          /* Set the I2S clock to the external clock  value */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        }
      /* Check if I2S clock selection is PLLI2S VCO output clock divided by PLL2C used as I2S clock */
      case RCM_I2SCLKSOURCE_PLLI2S:
        {
#if defined(APM32F411xx)
          /* Configure the PLLI2S division factor */
          /* PLLI2S_VCO Input  = PLL_SOURCE/PLL2B */
          if((RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS) == RCM_PLLSOURCE_HSE)
          {
            /* Get the I2S source clock value */
            vcoinput = (uint32_t)(HSE_VALUE / (uint32_t)(RCM->PLL2CFG & RCM_PLL2CFG_PLL2B));
          }
          else
          {
            /* Get the I2S source clock value */
            vcoinput = (uint32_t)(HSI_VALUE / (uint32_t)(RCM->PLL2CFG & RCM_PLL2CFG_PLL2B));
          }
#else
          /* Configure the PLLI2S division factor */
          /* PLLI2S_VCO Input  = PLL_SOURCE/PLLB */
          if((RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS) == RCM_PLLSOURCE_HSE)
          {
            /* Get the I2S source clock value */
            vcoinput = (uint32_t)(HSE_VALUE / (uint32_t)(RCM->PLL1CFG & RCM_PLL1CFG_PLLB));
          }
          else
          {
            /* Get the I2S source clock value */
            vcoinput = (uint32_t)(HSI_VALUE / (uint32_t)(RCM->PLL1CFG & RCM_PLL1CFG_PLLB));
          }
#endif /* APM32F411xx */
          /* PLLI2S_VCO Output = PLLI2S_VCO Input * PLL2A */
          vcooutput = (uint32_t)(vcoinput * (((RCM->PLL2CFG & RCM_PLL2CFG_PLL2A) >> 6U) & (RCM_PLL2CFG_PLL2A >> 6U)));
          /* I2S_CLK = PLLI2S_VCO Output/PLL2C */
          frequency = (uint32_t)(vcooutput /(((RCM->PLL2CFG & RCM_PLL2CFG_PLL2C) >> 28U) & (RCM_PLL2CFG_PLL2C >> 28U)));
          break;
        }
        /* Clock not enabled for I2S*/
      default:
        {
          frequency = 0U;
          break;
        }
      }
      break;
    }
#else
    case RCM_PERIPHCLK_USB:
    {
      /* Check if PLL is enabled */
      if (DAL_IS_BIT_SET(RCM->CTRL, RCM_CTRL_PLL1EN))
      {
        pllmul = (((RCM->CFG & RCM_CFG_PLLMULCFG) >> RCM_CFG_PLLMULCFG_Pos) + 2U) > 16U? 16U:\
                             (((RCM->CFG & RCM_CFG_PLLMULCFG) >> RCM_CFG_PLLMULCFG_Pos) + 2U);
        if((RCM->CFG & RCM_CFG_PLLSRCSEL) != RCM_PLLSOURCE_HSI_DIV2)
        {
          prediv = ((RCM->CFG & RCM_CFG_PLLHSEPSC) >> RCM_CFG_PLLHSEPSC_Pos) + 1;

          /* HSE used as PLL clock source : PLLCLK = HSE/PREDIV1 * PLLMUL */
          pllclk = (uint32_t)((HSE_VALUE  * pllmul) / prediv);
        }
        else
        {
          /* HSI used as PLL clock source : PLLCLK = HSI/2 * PLLMUL */
          pllclk = (uint32_t)((HSI_VALUE >> 1) * pllmul);
        }

        /* USBCLK = PLLCLK / USB prescaler */
        if (__DAL_RCM_GET_USB_SOURCE() == RCM_USBCLKSOURCE_PLL)
        {
          /* No prescaler selected for USB */
          frequency = pllclk;
        }
        else if(__DAL_RCM_GET_USB_SOURCE() == RCM_USBCLKSOURCE_PLL_DIV1_5)
        {
          /* Prescaler of 1.5 selected for USB */
          frequency = (pllclk * 2) / 3;
        }
        else if(__DAL_RCM_GET_USB_SOURCE() == RCM_USBCLKSOURCE_PLL_DIV2)
        {
          /* Prescaler of 2 selected for USB */
          frequency = pllclk / 2;
        }
        else
        {
          /* Prescaler of 2.5 selected for USB */
          frequency = (pllclk * 2) / 5;
        }
      }
      break;
    }
    case RCM_PERIPHCLK_I2S2:
    {
      /* SYSCLK used as source clock for I2S2 */
      frequency = DAL_RCM_GetSysClockFreq();
      break;
    }
    case RCM_PERIPHCLK_RTC:
    {
      /* Get RCM BDCTRL configuration ------------------------------------------------------*/
      temp_reg = RCM->BDCTRL;

      /* Check if LSE is ready if RTC clock selection is LSE */
      if (((temp_reg & RCM_BDCTRL_RTCSRCSEL) == RCM_RTCCLKSOURCE_LSE) && (DAL_IS_BIT_SET(temp_reg, RCM_BDCTRL_LSERDYFLG)))
      {
        frequency = LSE_VALUE;
      }
      /* Check if LSI is ready if RTC clock selection is LSI */
      else if (((temp_reg & RCM_BDCTRL_RTCSRCSEL) == RCM_RTCCLKSOURCE_LSI) && (DAL_IS_BIT_SET(RCM->CSTS, RCM_CSTS_LSIRDYFLG)))
      {
        frequency = LSI_VALUE;
      }
      else if (((temp_reg & RCM_BDCTRL_RTCSRCSEL) == RCM_RTCCLKSOURCE_HSE_DIV128) && (DAL_IS_BIT_SET(RCM->CTRL, RCM_CTRL_HSERDYFLG)))
      {
        frequency = HSE_VALUE / 128U;
      }
      /* Clock not enabled for RTC*/
      else
      {
        /* nothing to do: frequency already initialized to 0U */
      }
      break;
    }
    case RCM_PERIPHCLK_ADC:
    {
      frequency = DAL_RCM_GetPCLK2Freq() / (((__DAL_RCM_GET_ADC_SOURCE() >> RCM_CFG_ADCPSC_Pos) + 1) * 2);
      break;
    }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */
    default:
    {
      break;
    }
  }
  return frequency;
}
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F402xx || APM32F403xx */

#if defined(APM32F411xx) && defined(RCM_BDCTRL_LSEMOD)
/**
  * @brief  Select LSE mode
  *
  * @note   This mode is only available for APM32F411xx devices.
  *
  * @param  Mode specifies the LSE mode.
  *          This parameter can be one of the following values:
  *            @arg RCM_LSE_LOWPOWER_MODE:  LSE oscillator in low power mode selection
  *            @arg RCM_LSE_HIGHDRIVE_MODE: LSE oscillator in High Drive mode selection
  * @retval None
  */
void DAL_RCMEx_SelectLSEMode(uint8_t Mode)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_LSE_MODE(Mode));
  if(Mode == RCM_LSE_HIGHDRIVE_MODE)
  {
    SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEMOD);
  }
  else
  {
    CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEMOD);
  }
}

#endif /* APM32F411xx && RCM_BDCTRL_LSEMOD */

/** @defgroup RCMEx_Exported_Functions_Group2 Extended Clock management functions
 *  @brief  Extended Clock management functions
 *
@verbatim
 ===============================================================================
                ##### Extended clock management functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    activation or deactivation of PLLI2S, PLLSAI.
@endverbatim
  * @{
  */

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Enable PLLI2S.
  * @param  PLLI2SInit  pointer to an RCM_PLLI2SInitTypeDef structure that
  *         contains the configuration information for the PLLI2S
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RCMEx_EnablePLLI2S(RCM_PLLI2SInitTypeDef  *PLLI2SInit)
{
  uint32_t tickstart;

  /* Check for parameters */
  ASSERT_PARAM(IS_RCM_PLL2A_VALUE(PLLI2SInit->PLL2A));
  ASSERT_PARAM(IS_RCM_PLL2C_VALUE(PLLI2SInit->PLL2C));
#if defined(RCM_PLL2CFG_PLL2B)
  ASSERT_PARAM(IS_RCM_PLL2B_VALUE(PLLI2SInit->PLL2B));
#endif /* RCM_PLL2CFG_PLL2B */
#if defined(RCM_PLL2CFG_PLLI2SP)
  ASSERT_PARAM(IS_RCM_PLLI2SP_VALUE(PLLI2SInit->PLLI2SP));
#endif /* RCM_PLL2CFG_PLLI2SP */
#if defined(RCM_PLL2CFG_PLLI2SQ)
  ASSERT_PARAM(IS_RCM_PLLI2SQ_VALUE(PLLI2SInit->PLLI2SQ));
#endif /* RCM_PLL2CFG_PLLI2SQ */

