betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm_ex.c
  /* Disable the PLLI2S */
  __DAL_RCM_PLLI2S_DISABLE();

  /* Wait till PLLI2S is disabled */
  tickstart = DAL_GetTick();
  while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLL2RDY) != RESET)
  {
    if((DAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
    {
      /* return in case of Timeout detected */
      return DAL_TIMEOUT;
    }
  }

  /* Configure the PLLI2S division factors */
#if defined(APM32F411xx)
  /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) * (PLL2A/PLL2B) */
  /* I2SRCLK = PLLI2S_VCO / PLL2C */
  __DAL_RCM_PLLI2S_I2SCLK_CONFIG(PLLI2SInit->PLL2B, PLLI2SInit->PLL2A, PLLI2SInit->PLL2C);
#else
  /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) x PLL2A */
  /* I2SRCLK = PLLI2S_VCO / PLL2C */
  __DAL_RCM_PLLI2S_CONFIG(PLLI2SInit->PLL2A, PLLI2SInit->PLL2C);
#endif /* APM32F411xx */

  /* Enable the PLLI2S */
  __DAL_RCM_PLLI2S_ENABLE();

  /* Wait till PLLI2S is ready */
  tickstart = DAL_GetTick();
  while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLL2RDY) == RESET)
  {
    if((DAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
    {
      /* return in case of Timeout detected */
      return DAL_TIMEOUT;
    }
  }

 return DAL_OK;
}

/**
  * @brief  Disable PLLI2S.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RCMEx_DisablePLLI2S(void)
{
  uint32_t tickstart;

  /* Disable the PLLI2S */
  __DAL_RCM_PLLI2S_DISABLE();

  /* Wait till PLLI2S is disabled */
  tickstart = DAL_GetTick();
  while(READ_BIT(RCM->CTRL, RCM_CTRL_PLL2RDYFLG) != RESET)
  {
    if((DAL_GetTick() - tickstart) > PLLI2S_TIMEOUT_VALUE)
    {
      /* return in case of Timeout detected */
      return DAL_TIMEOUT;
    }
  }

  return DAL_OK;
}

#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @brief  Resets the RCM clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI ON and used as system clock source
  *            - HSE, PLL, PLLI2S and PLLSAI OFF
  *            - AHB, APB1 and APB2 prescaler set to 1.
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - LSI, LSE and RTC clocks
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RCM_DeInit(void)
{
  uint32_t tickstart;

  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Set HSIEN bit to the reset value */
  SET_BIT(RCM->CTRL, RCM_CTRL_HSIEN);

  /* Wait till HSI is ready */
  while (READ_BIT(RCM->CTRL, RCM_CTRL_HSIRDYFLG) == RESET)
  {
    if ((DAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }

  /* Set HSITRM[4:0] bits to the reset value */
  SET_BIT(RCM->CTRL, RCM_CTRL_HSITRM_4);

  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Reset CFG register */
  CLEAR_REG(RCM->CFG);

  /* Wait till clock switch is ready */
  while (READ_BIT(RCM->CFG, RCM_CFG_SCLKSELSTS) != RESET)
  {
    if ((DAL_GetTick() - tickstart) > CLOCKSWITCH_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }

  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Clear HSEEN, HSEBCFG and CSSEN bits */
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSEEN | RCM_CTRL_HSEBCFG | RCM_CTRL_CSSEN);

  /* Wait till HSE is disabled */
  while (READ_BIT(RCM->CTRL, RCM_CTRL_HSERDYFLG) != RESET)
  {
    if ((DAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }

  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Clear PLL1EN bit */
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_PLL1EN);

  /* Wait till PLL is disabled */
  while (READ_BIT(RCM->CTRL, RCM_CTRL_PLL1RDYFLG) != RESET)
  {
    if ((DAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }

#if defined(RCM_PLLI2S_SUPPORT)
  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Reset PLL2EN bit */
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_PLL2EN);

  /* Wait till PLLI2S is disabled */
  while (READ_BIT(RCM->CTRL, RCM_CTRL_PLL2RDYFLG) != RESET)
  {
    if ((DAL_GetTick() - tickstart) > PLLI2S_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }
#endif /* RCM_PLLI2S_SUPPORT */

#if defined(RCM_PLLSAI_SUPPORT)
  /* Get Start Tick */
  tickstart = DAL_GetTick();

  /* Reset PLLSAI bit */
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_PLLSAION);

  /* Wait till PLLSAI is disabled */
  while (READ_BIT(RCM->CTRL, RCM_CTRL_PLLSAIRDY) != RESET)
  {
    if ((DAL_GetTick() - tickstart) > PLLSAI_TIMEOUT_VALUE)
    {
      return DAL_TIMEOUT;
    }
  }
#endif /* RCM_PLLSAI_SUPPORT */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || defined(APM32F411xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Once PLL, PLLI2S and PLLSAI are OFF, reset PLLCFGR register to default value */
  RCM->PLL1CFG = RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLL1A_6 | RCM_PLL1CFG_PLL1A_7 | RCM_PLL1CFG_PLLD_2;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Reset PLLI2SCFGR register to default value */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
  RCM->PLL2CFG = RCM_PLL2CFG_PLL2A_6 | RCM_PLL2CFG_PLL2A_7 | RCM_PLL2CFG_PLL2C_1;
#elif defined(APM32F411xx)
  RCM->PLL2CFG = RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2A_6 | RCM_PLL2CFG_PLL2A_7 | RCM_PLL2CFG_PLL2C_1;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */

  /* Disable all interrupts */
  CLEAR_BIT(RCM->INT, RCM_INT_LSIRDYEN | RCM_INT_LSERDYEN | RCM_INT_HSIRDYEN | RCM_INT_HSERDYEN | RCM_INT_PLL1RDYEN);

#if defined(RCM_INT_PLL2RDYEN)
  CLEAR_BIT(RCM->INT, RCM_INT_PLL2RDYEN);
#endif /* RCM_INT_PLL2RDYEN */

  /* Clear all interrupt flags */
  SET_BIT(RCM->INT, RCM_INT_LSIRDYCLR | RCM_INT_LSERDYCLR | RCM_INT_HSIRDYCLR | RCM_INT_HSERDYCLR | RCM_INT_PLL1RDYCLR | RCM_INT_CSSCLR);

#if defined(RCM_INT_PLL2RDYCLR)
  SET_BIT(RCM->INT, RCM_INT_PLL2RDYCLR);
#endif /* RCM_INT_PLL2RDYCLR */

  /* Clear LSIEN bit */
  CLEAR_BIT(RCM->CSTS, RCM_CSTS_LSIEN);

  /* Reset all CSTS flags */
  SET_BIT(RCM->CSTS, RCM_CSTS_RSTFLGCLR);

  /* Update the SystemCoreClock global variable */
  SystemCoreClock = HSI_VALUE;

  /* Adapt Systick interrupt period */
  if(DAL_InitTick(uwTickPrio) != DAL_OK)
  {
    return DAL_ERROR;
  }
  else
  {
    return DAL_OK;
  }
}

#endif /* DAL_RCM_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

